app/controllers/page_controller.rb

  def index
    @pages = Page.all.map { |page| PageDecorator.new(page, view_context) }
---
SELECT "pages".* FROM "pages"

  def create
    @page = Page.new(page_params)
    if !@page.save
---
INSERT INTO "pages" ("created_at", "data", "identity", "updated_at") VALUES (?, ?, ?, ?)

  def show
    page = Page.find(params[:id])
---
SELECT  "pages".* FROM "pages"  WHERE "pages"."id" = ? LIMIT 1  [["id", 1]]